// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'.

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().
// const number = Number(prompt("Введіть число:"));

// if (number === 10) {
//   alert("Вірно");
// } else {
//   alert("Невірно");
// }

// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

// const min = Math.floor(Math.random() * 59);

// const min = Math.floor(Math.random() * 60); // Виправлено, щоб включити 59

// if (min >= 0 && min < 15) {
//   alert(`${min} входить в першу чверть`);
// } else if (min >= 15 && min < 30) {
//   alert(`${min} входить в другу чверть`);
// } else if (min >= 30 && min < 45) {
//   alert(`${min} входить в третю чверть`);
// } else if (min >= 45 && min < 60) {
//   alert(`${min} входить в четверту чверть`);
// }
// console.log(`Згенероване число: ${min}`);

// Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// (запитуй це значення у користувача через prompt).
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.
// const num = prompt("Введіть число от 1 до 4:");
// let result = " ";

// switch (num) {
//   case "1":
//     result = "зима";
//     break;
//   case "2":
//     result = "весна";
//     break;
//   case "3":
//     result = "літо";
//     break;
//   case "4":
//     result = "осінь";
//     break;
//   default:
//     result = "Вибачте, але ви маєте ввести значення від 1 до 4 включно";
// }
// console.log(result);

// Напишіть функцію getNumbers(min, max), що приймає 2 параметри -
// мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції, який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
// і поверніть її з функції.
function getNumbers(min, max) {
  if (typeof min !== "number" || typeof max !== "number") {
    return "Not a number";
  }
  {
    let sum = 0;
    for (let i = max; i >= min; i--) {
      console.log(i);
      if (i % 2 === 0) {
        sum += i;
      }
    }
    return sum;
  }

  console.log(getNumbers(1, 10));
}
